tutorials/DXOverIsoFlow/integratedSystem/background/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 1e-06;

boundaryField
{
    overset1
    {
        type            overset;
    }
    stationaryWalls
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }
    perforatedWall
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
    floatingObject
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
}


// ************************************************************************* //
