tutorials/DXOverIsoFlow/integratedSystem/background/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset1
    {
        type            overset;
    }

    stationaryWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    perforatedWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    floatingObject
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}



// ************************************************************************* //
