tutorials/DXOverIsoFlow/integratedSystem/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0.0      0.0    -0.5)
    (14.7     0.0    -0.5)
    (14.7     0.02   -0.5)
    (0.0      0.02   -0.5)
    (0.0      0.0    0.34)
    (14.7     0.0    0.34)
    (14.7     0.02   0.34)
    (0.0      0.02   0.34)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (366 1 117) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other
    // bcs
    overset1
    {
        type overset;
        faces ();
    }

    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    emptyWalls
    {
        type empty;
        faces
        (
        	(0 1 5 4)
        	(2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
